# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy as sp

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here

temp = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [3]:
# your code here

temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
# your code here

temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [6]:
"""
We can observe that we have two types of Data, object for City and State and another one for Temperature
"""

'\nWe can observe that we have two types of Data, object for City and State and another one for Temperature\n'

#### Select the rows where state is New York.

In [8]:
# your code here

temp_NY = temp[temp['State'] == 'New York']
temp_NY

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [9]:
# your code here

temp_NY.mean()

C:\Users\Angela\AppData\Local\Temp\ipykernel_15880\539124059.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  temp_NY.mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [13]:
# your code here

morethan15 = temp.loc[temp['Temperature'] > 15, ['City', 'State']]
morethan15

       City        State
0       NYC     New York
3  Hartford  Connecticut
5    Treton   New Jersey
6    Newark   New Jersey

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [14]:
# your code here

morethan15 = temp.loc[temp['Temperature'] > 15, ['City']]
morethan15

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [16]:
# your code here

more15_less20 = temp.loc[(temp['Temperature'] > 15) & (temp['Temperature'] < 20), ['City']]
more15_less20

       City
0       NYC
3  Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [24]:
# MEAN and STDEV of each STATE! - FUNCTION: temp.groupby('State').describe() - It will give all relevant statistical data

temp.groupby('State').describe()

            Temperature                                                        \
                  count       mean       std        min        25%        50%
State
Connecticut         2.0  15.833333  1.964186  14.444444  15.138889  15.833333
New Jersey          2.0  21.111111  1.571348  20.000000  20.555556  21.111111
New York            3.0  10.740741  8.133404   3.333333   6.388889   9.444444


                   75%        max
State
Connecticut  16.527778  17.222222
New Jersey   21.666667  22.222222
New York     14.444444  19.444444

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [64]:
# your code here

employees = pd.read_csv("Employee.csv")

#### Explore the data types of the `employees` dataframe. Comment your results.

In [65]:
# your code here

employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [35]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [34]:
"""
We have two different type of data: Objects (all except from years and salary) and integers (just for salary and years)
"""

'\nWe have two different type of data: Objects (all except from years and salary) and integers (just for salary and years)\n'

#### What's the average salary in this company?

In [6]:
# your code here

employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [7]:
# your code here

employees['Salary'].max()

70

#### What's the lowest salary?

In [8]:
# your code here

employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [9]:
# your code here

lowest = employees[employees['Salary'] == employees['Salary'].min()]
lowest

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [43]:
# your code here
# What is the problem? 

employees[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [42]:
# your code here

employees.loc[employees['Name'] == 'David', 'Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [41]:
# your code here

employees[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [44]:
# Method 1
# your code here

employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [36]:
# Method 2
# your code here

employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [38]:
# your code here

employees[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [40]:
# your code here
# Group - employees.groupby - years, average salary (mean)

employees.groupby('Years').agg({'Salary':'mean'})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [46]:
# your code here

employees.groupby('Title').agg({'Salary':'mean'})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [57]:
# your code here

employees['Salary'].quantile(0)

30.0

In [58]:
employees['Salary'].quantile(0.25)

35.0

In [59]:
employees['Salary'].quantile(0.5)

55.0

In [60]:
employees['Salary'].quantile(0.75)

60.0

#### Is the mean salary different per gender?

In [61]:
# your code here

employees.groupby('Gender').agg({'Salary':'mean'})

        Salary
Gender
F         47.5
M         50.0

In [ ]:
# Yes. Women salary is lower than men one

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [71]:
# your code here
# group.by - Department (and in each department agg. min, max and mean).dtypes(number)

employees.groupby('Department').agg(['min', 'mean', 'max']).select_dtypes('number')

C:\Users\Angela\AppData\Local\Temp\ipykernel_3440\1752892980.py:4: FutureWarning: ['Name', 'Education', 'Gender', 'Title'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  employees.groupby('Department').agg(['min', 'mean', 'max']).select_dtypes('number')

           Years               Salary
             min      mean max    min   mean max
Department
HR             2  4.666667   8     30  45.00  70
IT             1  4.500000   8     30  48.75  70
Sales          2  2.500000   3     55  55.00  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [68]:
# your code here

orders = pd.read_csv('Orders.csv')
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [70]:
# your code here

orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [ ]:
"""
We have integers, objects and floats type
"""

####  What is the average purchase price?

In [72]:
# your code here

orders['amount_spent'].mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [73]:
# your code here

orders['amount_spent'].min()

0.0

In [74]:
orders['amount_spent'].max()

168469.6

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [78]:
# your code here


orders.loc[orders['Country'] == 'Spain', 'CustomerID']

4250      12557
4251      12557
4252      12557
4253      12557
4254      12557
          ...
394733    17097
394734    17097
394735    17097
394736    17097
394737    17097
Name: CustomerID, Length: 2485, dtype: int64

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here